IDEA Open Model
ConcreteULSCheckResultDiagramCapacityEc2 Properties
Compatible with IDEA StatiCa v 10.1
The ConcreteULSCheckResultDiagramCapacityEc2 type exposes the following members.
Properties
Name | Description
Fu
 calculated ultimate internal forces
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
Fu1
 calculated ultimate internal forces
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
Fu2
 calculated ultimate internal forces
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckMethod
 method of check
 (Inherited from ConcreteULSCheckResultDiagramCapacity.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
ConcreteULSCheckResultDiagramCapacityEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace